# -*- coding:utf-8 -*-


# 日志级别字典
log_level_dict = {0:'DEBUG', 1:'INFO', 2:'WARN', 3:'ERROR'}

# 监控项类型字典
monitor_item_dict = {'A':'单个变量','B':'计算公式'}

# 图表类型
show_type_dict = {1:'4小时', 2:'1天', 3:'1个月', 4:'1年'}
#show_type_dict = {1:'4小时', 2:'1天', 3:'1个月', 4:'1年', 5:'3天', 6:'1周'}

# 权限类型
permission_type_dict = {1:'模块',2:'应用项',3:'监控项',4:'节点', 5:'产品(语义监控)'}

# 日志类型
log_type_dict = {0:'其他日志', 1:'用户管理日志', 2:'角色管理日志', 3:'应用项管理日志', \
 4:'监控项管理日志', 5:'节点管理日志',6:'服务组',7:'测试集',8:'产品'}

# 联合图表类型
combine_type_dict = {1:'曲线图',2:'饼图',3:'柱形图'}

# 图表类型
chart_type_dict = {0:'单数据源曲线图',1:'多数据源曲线图',2:'饼图',3:'柱形图'}

# 监控类型
alarm_type_dict = {0:'否', 1:'是'}

# 产品 (改为在数据库中配置)
#product_dict = {1:'公交导航',2:'驾车导航',3:'步行导航',4:'lse搜索服务'}

# IDC
idc_dict = {1:'亦庄',2:'上地',3:'天津',4:'南京',5:'青岛',6:'大恒',7:'方恒',8:'昌平'}

# yes_no
yes_no_dict = {0:'否', 1:'是'}

# 任务状态
task_status_dict = {0:'初始', 1:'处理中', 2:'处理完成'}

# 是否通过
is_pass_dict = {0:'未通过',1:'通过'}



